{"id":"concepts/grid/height-and-scrolling","title":"Height And Scrolling","contents":"<h1 id=\"height-and-scrolling\"><a href=\"#height-and-scrolling\" aria-hidden><span class=\"icon icon-link\"></span></a>Height And Scrolling</h1>\n<p>In the layout introduction we covered the different sections of the table, how meta rows (header, footer, etc...) differ by type (fixed, row, sticky)\nand how they interact with each section and with the data rows.</p>\n<p>Height and scrolling refer to:</p>\n<ul>\n<li>Total grid height (the height of <code class=\"language-text\">&lt;pbl-ngrid&gt;</code>)</li>\n<li>The height of the data rows section</li>\n<li>The data rows section scroll bar</li>\n<li>The grid's scrollbar (<code class=\"language-text\">&lt;pbl-ngrid&gt;</code>)</li>\n</ul>\n<p>The following effects the height and scrolling:</p>\n<ul>\n<li>CSS style of the grid (<code class=\"language-text\">&lt;pbl-ngrid&gt;</code>) (height)</li>\n<li>Virtual scroll mode</li>\n<li>The layout of meta rows (fixed VS row VS sticky)</li>\n<li><code class=\"language-text\">PblNgridComponent.fallbackMinHeight</code></li>\n</ul>\n<p>All of the above is user defined and different combinations create different height and scrolling layouts.\nWe will not cover all possible combination, instead we will explain the effect of each definition.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n To best visualize the effects we will use a column definition set with multiple meta rows (fixed)\n</blockquote>\n<div pbl-example-view=\"pbl-grid-height-grid-example\"></div>\n<h2 id=\"fallbackminheight\"><a href=\"#fallbackminheight\" aria-hidden><span class=\"icon icon-link\"></span></a>fallbackMinHeight</h2>\n<p>The <code class=\"language-text\">fallbackMinHeight</code> input defines the absolute minimum height (in pixels) to assign to the data row section container (not the grid).</p>\n<p>When not set, no minimum height is defined to the data row section container which can lead to different outcomes depending on the virtual scroll mode.</p>\n<h3 id=\"fallbackminheight-with-virtual-scroll\"><a href=\"#fallbackminheight-with-virtual-scroll\" aria-hidden><span class=\"icon icon-link\"></span></a>fallbackMinHeight with virtual scroll</h3>\n<p>When <strong>virtual scroll</strong> is enabled the data row section's height is based on the grid's height.<br>\nThis means that if there is not explicit height set to the grid the data row's section will have a height of 0.</p>\n<p>To work around that you can either:</p>\n<ul>\n<li>Set a height to the grid (%, px, flex or any other method).</li>\n<li>Set the <strong>fallbackMinHeight</strong> input property of the grid</li>\n</ul>\n<p>In the example above you can see that setting the grid's height is not enough (<strong>Explicit grid height</strong>) and you also need to check <strong>Set fallbackMinHeight to 150</strong>.\nThis happen because the explicit grid height set is <strong>300px</strong> but we have a lot of meta rows which take more then 300px, so data rows get no height.</p>\n<p>If the total height of all meta rows would have been 100px the data rows section would have been 200px.</p>\n<p>If virtual scroll is enabled and <strong>Set fallbackMinHeight to 150</strong> is set to true the total height of the grid will be 150px (data rows) plus the total height of all meta rows.</p>\n<h3 id=\"fallbackminheight-without-virtual-scroll\"><a href=\"#fallbackminheight-without-virtual-scroll\" aria-hidden><span class=\"icon icon-link\"></span></a>fallbackMinHeight without virtual scroll</h3>\n<p>When <strong>virtual scroll</strong> is disabled the data row section will take all the space it needs to render all rows.</p>\n<p>If the grid has an explicit height set the grid will show a single scroll bar that will scroll all rows, including meta rows of type fixed.</p>\n<p>However, when <strong>virtual scroll</strong> is disabled and <strong>fallbackMinHeight</strong> is set, the behavior of <strong>fallbackMinHeight</strong> is a bit different.\nIn such case, the data row section is limited to the height set in <strong>fallbackMinHeight</strong>.</p>\n<h4 id=\"multiple-scroll-bars\"><a href=\"#multiple-scroll-bars\" aria-hidden><span class=\"icon icon-link\"></span></a>Multiple scroll bars</h4>\n<p>Multiple bar scroll bars are something you should avoid.</p>\n<p>To reproduce them in the example above:</p>\n<ul>\n<li>Disable virtual scroll</li>\n<li>Enable explicit grid height &#x26; fallbackMinHeight</li>\n</ul>\n<p>The reason for having 2 scroll bars is the fact that we have a grid height limit of 300px that contains a data row section of 150px plus multiple meta rows that\ntake more then the remaining 150px.</p>\n<p>The result is a scroll bar for the entire gris and a scroll bar for the data rows section.</p>\n"}