{"id":"concepts/context/what-is-the-context","title":"What is the Context","contents":"<h1 id=\"what-is-the-context\"><a href=\"#what-is-the-context\" aria-hidden><span class=\"icon icon-link\"></span></a>What is the Context</h1>\n<p>Each row in the grid has data, the row data is used to display the cells on each row.</p>\n<p>In addition to the data each row has a context object which is used to store state about the row and the cells of the row.</p>\n<h2 id=\"why\"><a href=\"#why\" aria-hidden><span class=\"icon icon-link\"></span></a>Why</h2>\n<p>Why do we need context? We need it so we can switch between various states a row/cell can be in and to persist that state.<br>\nFor example, the context will hold the <strong>editing</strong> state, indicating if a cell is currently in \"edit\" mode.</p>\n<p>This is just a simple example, the context becomes powerful when we start showing a small subset of the entire row collection.  </p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n I.E: When we use pagination, filtering and/or virtual scroll.\n</blockquote>\n<p>Let's explain with a simple example:</p>\n<div pbl-example-view=\"pbl-context-example-example\"></div>\n<p>The grid above is using pagination to split the data collection into \"pages\".<br>\nIn addition, each cell under the <strong>name</strong> column can be edited when double clicking on it with the mouse.</p>\n<p>When we active \"edit\" mode on a cell the context of the cell is updated and the edit flag is set to true.<br>\nNow, when a cell is being editing, if we click on the pagination \"next\" button we will see all rows replaced with new rows, the edit is gone.<br>\nNow, if we click the pagination \"back\" button we get back to our original view and now we see the edit back on, where we left it, thanks to the context.</p>\n<p>This is also true when toggling the sort component (click on the \"name\" column)</p>\n<h2 id=\"context--identity\"><a href=\"#context--identity\" aria-hidden><span class=\"icon icon-link\"></span></a>Context &#x26; Identity</h2>\n<p>To match context to a row, each row in the collection must be unique so when required we can easily match the row and the context.<br>\nThe order of the rows in the collection does not qualify, we've just seen how we can sort the collection creating a different order inside the collection.</p>\n<p>We need to mark the column that reflects the uniqueness of each row as the <a href=\"../../columns/identity\">Identity Column</a>.  </p>\n<p>In the example above we've marked the <code class=\"language-text\">id</code> column as the identity column by adding <code class=\"language-text\">pIndex: true</code> to the column definition.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n If there is no unique column context support is available but limited.\n</blockquote>\n<p>For example, if we remove the <code class=\"language-text\">pIndex</code> from the example above, each click for sort/pagination will clear the cache since\nthere is no way for the context to identify and match exiting context to rows.</p>\n"}