{"id":"features/grid/virtual-scroll/performance","title":"Performance","contents":"<h1 id=\"virtual-scroll-performance\"><a href=\"#virtual-scroll-performance\" aria-hidden><span class=\"icon icon-link\"></span></a>Virtual Scroll Performance</h1>\n<p>Without virtual scrolling, loading a datasource with 10,000 rows will takes a lot of time and will probably freeze the browser.</p>\n<p>With virtual scrolling loading is instant but it does not come for free, when scrolling the table will calculate the new scroll position matching\nit to the rows that should appear in that scroll offset and render them on page.</p>\n<p>When the offset is changing gradually the performance impact is minimal but when the change is rapid with large gaps there might be performance issues.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n Performance issues means lower frame rate, which happens when it takes more time to render new rows. This is why larger offset means less performance\nbecause more rows are rendered on each scroll.\n</blockquote>\n<p>Rapid scrolling with large offsets can occur when scrolling with the <strong>wheel</strong> or in mobile with <strong>touch move</strong>.</p>\n<p>In most browsers, when rendering takes more time the end result is an empty table while scrolling. The rows we had at the start are long out of the view but new rows\ndid not have the time to render in the frame.</p>\n<blockquote class=\"warn icon\">\n<div class=\"icon-location\"></div>\n \n<strong>wheelMode</strong>\n works for wheel events, its does not apply for touch events. Messing around with touch behavior on mobile devices will\nmake the scrolling behavior feel un-natural. Scrolling in touch devices, using touch is always passive.\n</blockquote>\n<p>To tackle this the <code class=\"language-text\">[wheelMode]</code> mode directive offers 3 strategies:</p>\n<h2 id=\"passive-default\"><a href=\"#passive-default\" aria-hidden><span class=\"icon icon-link\"></span></a>Passive (default)</h2>\n<p>Do nothing, let the browser handle the rendering and if no rows are shown while browsing let it be.</p>\n<h2 id=\"blocking\"><a href=\"#blocking\" aria-hidden><span class=\"icon icon-link\"></span></a>Blocking</h2>\n<p>Do not let the browser scroll until all rows in the current offset are rendered.</p>\n<p>This will result in a lower scrolling speed with the wheel but with a scrolling UX behavior. The scrolling speed\ndepends on the frame rate, at 60FPS you will not feel a thing but at 5 FPS the experience is bad.</p>\n<h2 id=\"threshold\"><a href=\"#threshold\" aria-hidden><span class=\"icon icon-link\"></span></a>Threshold</h2>\n<p>Provide a frame rate threshold that define when to use <strong>Passive</strong> mode and when to use <strong>Blocking</strong> mode.</p>\n<p>Each scrolling events start with the <strong>Blocking</strong> behavior but when the frame rate drops below the threshold the behavior\nswitch's to <strong>Passive</strong>.</p>\n<p>It is always preferred to render at 60FPS but sometimes it is not possible and we can compromise on lower frame rate in favor of a real UI scroll feel.</p>\n<p>Like all trade-offs, it is best to meet at middle ground. Provide a <strong>threshold</strong> within your limits, usually between 15 FPS to 25 FPS.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n Measuring performance is tricky as it depends on the CPU power of the host, the complexity of the cells, the size of the viewport (row count) and the scroll speed.\nTry to avoid complex cells, \n<strong>Blocking</strong>\n behavior and low \n<strong>threshold</strong>\n values.\n</blockquote>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n For a live example see the \n<a href=\"../../../../demos/virtual-scroll-performance\">virtual scroll performance</a>\n demo.\n</blockquote>\n"}