{"id":"concepts/grid/height-and-scrolling","title":"Height And Scrolling","contents":"<h1 id=\"height-and-scrolling\"><a href=\"#height-and-scrolling\" aria-hidden><span class=\"icon icon-link\"></span></a>Height And Scrolling</h1>\n<p>In the layout introduction we covered the different sections of the grid.<br>\nHow meta rows (header, footer, etc...) differ by type (fixed, row, sticky) and how they interact with each section and with the data rows.</p>\n<p>All of the components in the layout are stacked vertically, one after the other.<br>\nThis vertical stack affect and is affected by the height.</p>\n<p>In this section we will explain how height affect the vertical stack and how it is affected by the stack itself.<br>\nTo simplify things we will only refer to 2 categories in the stack:</p>\n<ul>\n<li><strong>Data Viewport</strong> - The section containing data rows</li>\n<li><strong>Metadata Viewport</strong> - All other sections (before and after)</li>\n</ul>\n<p>When the grid create the layout, it will first let all of the components in the <strong>Metadata Viewport</strong> occupy the height they need.<br>\nOnce done, the remaining height will be occupied by the <strong>Data Viewport</strong>, assuming there is height left to occupy.</p>\n<p>In other words, by default, the data viewport has no size and it will grow based on the available space it has left in the container.</p>\n<p>The following effects the height and scrolling:</p>\n<ul>\n<li>CSS style of the grid (<code class=\"language-text\">&lt;pbl-ngrid&gt;</code>) (height)</li>\n<li>The layout of meta rows (fixed VS row VS sticky) and size of items in the <strong>Metadata Viewport</strong></li>\n<li>The value defined in <code class=\"language-text\">PblNgridComponent.minDataViewHeight</code></li>\n</ul>\n<p>The height provided, will effect the <strong>Data Viewport</strong> and if no height is set, it will be set by the layout itself.</p>\n<p>All of the above is user defined and different combinations will create different height and scrolling layouts.\nWe will not cover all possible combination, instead we will explain the effect of each definition.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n To best visualize the effects we will use a column definition set with multiple meta rows (fixed), i.e meta rows are \n<strong>outside</strong>\n of the data viewport\n</blockquote>\n<div pbl-example-view=\"pbl-grid-height-grid-example\" containerClass=\"mat-elevation-z7\"></div>\n<h2 id=\"mindataviewheight\"><a href=\"#mindataviewheight\" aria-hidden><span class=\"icon icon-link\"></span></a>minDataViewHeight</h2>\n<p>When the container height is fixed and there is no height left for the data viewport then it will get no height (0 height).</p>\n<p>To simulate this in the example, set the <strong>Explicit Grid Height</strong> to <code class=\"language-text\">300</code> and the <strong>minDataViewHeight</strong> to <code class=\"language-text\">None</code>.<br>\nThe items in the <strong>Metadata Viewport</strong> occupy more then 300px, leaving no space for the data rows.</p>\n<p>To solve this, we need a way to tell the grid to assign a minimum height to the <strong>Data Viewport</strong>.</p>\n<p>We do this by setting the <code class=\"language-text\">@Input</code> property <strong>minDataViewHeight</strong> which accepts a <code class=\"language-text\">number</code> in 2 variations:</p>\n<p>A. Default minimum height in explicit pixels<br>\nB. Default minimum height based on an initial amount of rows, multiplied by the row height.</p>\n<p>For variation <strong>A</strong>, provide a positive value, for <strong>B</strong> provide a negative value.</p>\n<p>For example:</p>\n<p>A. Minimum data viewport of 100 pixels: <code class=\"language-text\">&lt;pbl-ngrid minDataViewHeight=&quot;100&quot;&gt;&lt;/pbl-ngrid&gt;</code><br>\nB. Minimum data viewport of 2 ros: <code class=\"language-text\">&lt;pbl-ngrid minDataViewHeight=&quot;-2&quot;&gt;&lt;/pbl-ngrid&gt;</code></p>\n<p><strong>Notes when using the row variation</strong></p>\n<ul>\n<li>The row height is calculated based on an initial row pre-loaded by the grid, this row will get it's height from the CSS theme defined.</li>\n<li>The final amount of rows is the lower value between the row count input and the total rows to render.<br>\ni.e. If the input is 1,000,000 rows and there are only 2, the height occupied will reflect 2 rows.</li>\n</ul>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n Once height is assigned to the \n<strong>Data Viewport</strong>\n the user can view all of the data using the scrollbar.\n</blockquote>\n<h2 id=\"examples\"><a href=\"#examples\" aria-hidden><span class=\"icon icon-link\"></span></a>Examples</h2>\n<p>Let's explore some scenarios and understand the result.</p>\n<h3 id=\"auto-size-of-the-data-viewport\"><a href=\"#auto-size-of-the-data-viewport\" aria-hidden><span class=\"icon icon-link\"></span></a>Auto Size of the Data Viewport</h3>\n<p>When the <strong>minDataViewHeight</strong> is set to <code class=\"language-text\">None</code>, items in the <strong>Data Viewport</strong> will occupy space\n<strong>only</strong> if there is any left.</p>\n<p>In the example above, setting the <strong>Explicit Grid Height</strong> to <code class=\"language-text\">300</code> is not enough, we need a value which is greater then the total\nheight of the <strong>Metadata Viewport</strong>. If you set it to <code class=\"language-text\">500</code> or above, you will see data rows.</p>\n<p>The <strong>Data Viewport</strong> will grow as much as it is allowed to, when no <strong>minDataViewHeight</strong> is set</p>\n<h3 id=\"container-overflow\"><a href=\"#container-overflow\" aria-hidden><span class=\"icon icon-link\"></span></a>Container Overflow</h3>\n<p>If we set the <strong>Explicit Grid Height</strong> to <code class=\"language-text\">300</code> and the <strong>minDataViewHeight</strong> to <code class=\"language-text\">10 Rows</code> we end up with a strange layout, containing 2 vertical scroll bars.</p>\n<p>This happen because the calculated minimum height of the <strong>Data Viewport</strong> PLUS the total height of the <strong>Metadata Viewport</strong> is greater then the\nfixed height we set (300) causing it to overflow and forcing the container to show the scroll bar.</p>\n<p>Since there are more rows to render then available height in the <strong>Data Viewport</strong> it also show a scroll bar.</p>\n<p>This is something to avoid, the best approach (when possible) is not to limit the size of the grid (or limit with a big enough value) so this won't happen.</p>\n<h2 id=\"remember-it-is-minimum\"><a href=\"#remember-it-is-minimum\" aria-hidden><span class=\"icon icon-link\"></span></a>Remember, it is minimum</h2>\n<p>If we set the <strong>Explicit Grid Height</strong> to <code class=\"language-text\">750</code> and the <strong>minDataViewHeight</strong> to <code class=\"language-text\">3 Rows</code> we end up with more then 3 data rows rendered.</p>\n<p>This is because <strong>minDataViewHeight</strong> set's the minimum height, if there is space, it will be occupied.</p>\n"}