{"id":"concepts/datasource/extending-the-datasource","title":"Extending The Datasource","contents":"<h1 id=\"extending-the-datasource\"><a href=\"#extending-the-datasource\" aria-hidden><span class=\"icon icon-link\"></span></a>Extending The Datasource</h1>\n<p>The default datasource factory and datasource implementation provided with <strong>nGrid</strong> will do the trick for most of the use cases.<br>\nSometimes, however, a custom approach is required.</p>\n<p>This is where custom extensions of the datasource are in-place.</p>\n<p>The actual structure of the datasource is split into 3 parts:</p>\n<ul>\n<li><code class=\"language-text\">PblDataSource&lt;T&gt;</code></li>\n<li><code class=\"language-text\">PblDataSourceAdapter&lt;T, TData&gt;</code></li>\n</ul>\n<p><code class=\"language-text\">PblDataSource&lt;T&gt;</code> handles all external APIs and the adapter implements the logic.</p>\n<p>The 3rd part, the factory, binds the two together and exposes a simple API for us to use.</p>\n<p>In addition, where needed, you can also extends the event object, <code class=\"language-text\">PblDataSourceTriggerChangedEvent</code> and add custom metadata and logic to it.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n The event object provide metadata about the source and reason for the trigger but it might also include methods to interact and update\nthe process.\n</blockquote>\n<p>For example, the default factory that comes with <strong>nGrid</strong> is bundled with an adapter that automatically handles sorting, filtering and pagination\n(client side mode) but also contains logic that allow \"outsourcing\" selected operations to the user.</p>\n<p>In server side mode opting to manually implement pagination will result in an event triggered every time the pagination changed\nexpecting a new source of data from the event handler.</p>\n<blockquote class=\"info icon\">\n<div class=\"icon-location\"></div>\n The \n<a href=\"../../../features/grid/infinite-scroll\">Infinite Scroll</a>\n plugin is a good example of how to extend the datasource.\n</blockquote>\n"}